{
    "title": "@142 L2 - Quando utilizar cada estrutura de dados?",
    "description": "<!DOCTYPE html>\n<html xmlns=\"http://www.w3.org/1999/xhtml\" lang=\"\" xml:lang=\"\">\n<head>\n  <meta charset=\"utf-8\" />\n  <meta name=\"generator\" content=\"pandoc\" />\n  <meta name=\"viewport\" content=\"width=device-width, initial-scale=1.0, user-scalable=yes\" />\n  <title>@142 L2 - Quando utilizar cada estrutura de dados\\?</title>\n  <style>\n    code{white-space: pre-wrap;}\n    span.smallcaps{font-variant: small-caps;}\n    span.underline{text-decoration: underline;}\n    div.column{display: inline-block; vertical-align: top; width: 50%;}\n    div.hanging-indent{margin-left: 1.5em; text-indent: -1.5em;}\n    ul.task-list{list-style: none;}\n  </style>\n  <link rel=\"stylesheet\" href=\"/home/tiger/Dropbox/gits/0_tools/indexer/pandoc.css\" />\n  <!--[if lt IE 9]>\n    <script src=\"//cdnjs.cloudflare.com/ajax/libs/html5shiv/3.7.3/html5shiv-printshiv.min.js\"></script>\n  <![endif]-->\n</head>\n<body>\n<h2 id=\"l2---quando-utilizar-cada-estrutura-de-dados\"><span class=\"citation\" data-cites=\"142\">@142</span> L2 - Quando utilizar cada estrutura de dados?</h2>\n<h2 id=\"qxcode\"><span class=\"citation\" data-cites=\"qxcode\">@qxcode</span></h2>\n<p>Pesquise e escreva um texto sobre quando utilizar cada uma das estruturas de dados apresentadas.</p>\n<ul>\n<li>Quando utilizar vector e quando utilizar list?</li>\n<li>Quando devo utilizar set no lugar de vector ou list?</li>\n<li>Quando devo utilizar um mapa?</li>\n<li>Qual a diferença entre uma mapa ou set implementados sobre árvore ou sobre hash?</li>\n</ul>\n<h1 id=\"descrição\">Descrição</h1>\n<p>A forma como os elementos armazenados estão organizados em uma estrutura de dados determina diretamente o desempenho (de tempo e espaço) dessa estrutura.</p>\n<p>Pensando nisso, a nossa atividade consiste em analisar o desempenho de algumas estruturas quando realizamos operações de inserção, remoção e busca.</p>\n<p>A partir de um arquivo de entrada contendo valores e operações a serem realizadas sobre esses valores, meça o tempo que a implementação sobre cada estrutura leva para processar o arquivo.</p>\n<ul>\n<li>vector não ordenado com busca sequencia e remoção com realocação</li>\n<li>vector ordenado com busca binária e remoção por marcação</li>\n<li>lista encadeada não ordenada</li>\n<li>lista encadeada ordenada</li>\n<li>set</li>\n<li>unordered_set</li>\n</ul>\n<h2 id=\"arquivo-de-entrada\">Arquivo de entrada</h2>\n<p>Cada par ocupa uma linha do arquivo. As operações são representadas por um único caractere, onde:</p>\n<ul>\n<li>‘i’ representa inserção,</li>\n<li>‘r’ representa remoção e</li>\n<li>‘s’ representa busca.</li>\n</ul>\n<p>O valor é um número inteiro qualquer. Um exemplo de um trecho de arquivo de entrada pode ser visto abaixo.</p>\n<pre><code>i 666662\ni 566772\ns 566772\ni 840981\nr 566772\ni 931128\nr 666662\ni 62706\nr 4861\ns 931128\ns 929857</code></pre>\n<p>No exemplo, a primeira operação a ser realizada é inserir 666662 na estrutura, depois inserir 566772, buscar 566772 e seguem as demais operações sobre seus respectivos valores seguindo as regras já descritas.</p>\n<p>Como restrição, desejamos que cada número seja inserido apenas se ele já não existir na estrutura.</p>\n<h2 id=\"entrega\">Entrega</h2>\n<p>A sequência de operações presentes no arquivo de entrada deve ser aplicadas à três estruturas do C++: vector, list e set.</p>\n<p>Para cada arquivo de entrada, deve ser contabilizado o tempo levou para realizar todas as operações. Ao final das simulações, escreva um relatório respondendo as seguintes perguntas: 1. Quanto tempo levou para cada estrutura processar cada um dos arquivos? 2. Houve uma diferença de desempenho entre as estruturas testadas? 3. Se houve, o que pode ter gerado essa diferença?</p>\n<p>Conte também a quantidade de operações bem sucedidas. 1. Quantas inserções foram executadas com sucesso. 2. Quantas remoções foram executadas com sucesso. 3. Quantas buscas foram executadas com sucesso.</p>\n</body>\n</html>\n",
    "executionFiles": [
        {
            "name": "vpl_evaluate.cases",
            "contents": "",
            "encoding": 0
        }
    ],
    "requiredFile": null
}
